package com.golfeven.weather;

import java.util.HashMap;
import java.util.Map;

import com.golfeven.firstGolf.common.MyLog;
import com.golfeven.firstGolf.common.StringUtils;

public class WeatherUtil {
	
	static final String  DEFAULT_CITYID="101020100"; 
	
	static Map<String, String> place = new HashMap<String, String>();
	static String bj="北京101010100.";
	static String sh="上海101020100.";
	static String tj="天津101030100.";
	static String cq="重庆101040100.";
	static String xg="香港101320101.";
	static String am="澳门101330101.";
	
	
	//黑龙江
	static String hlj="哈尔滨101050101.齐齐哈尔101050201.牡丹江101050301.大庆101050901.伊春101050801.双鸭山101051301.鹤岗101051201.鸡西101051101.佳木斯101050401.七台河101051002.黑河101050601.绥化101050501.大兴安岭101050701.";
	//吉林
	static String jl="长春101060101.延吉101060301.吉林101060201.白山101060901.白城101060601.四平101060401.松原101060801.辽源101060701.大安101060603.通化101060501.";
	//辽宁
	static String ln="沈阳101070101.大连101070201.葫芦岛101071401.盘锦101071301.本溪101070501.抚顺101070401.铁岭101071101.辽阳101071001.营口101070801.阜新101070901.朝阳101071201.锦州101070701.丹东101070601.鞍山101070301.";
	//内蒙古
	static String nmg="呼和浩特101080101.呼伦贝尔101081000.锡林浩特101080901.包头101080201.赤峰101080601.海拉尔101081001.乌海101080301.鄂尔多斯101080701.通辽101080501.";
	//河北
	static String hb="石家庄101090101.唐山101090501.张家口101090301.廊坊101090601.邢台101090901.邯郸101091001.沧州101090701.衡水101090801.承德101090402.保定101090201.秦皇岛101091101.";
	//河南
	static String hn="郑州101180101.开封101180801.洛阳101180901.平顶山101180501.焦作101181101.鹤壁101181201.新乡101180301.安阳101180201.濮阳101181301.许昌101180401.漯河101181501.三门峡101181701.南阳101180701.商丘101181001.信阳101180601.周口101181401.驻马店101181601.";
	//山东
	static String sd="济南101120101.青岛101120201.淄博101120301.威海101121301.曲阜101120710.临沂101120901.烟台101120501.枣庄101121401.聊城101121701.济宁101120701.菏泽101121001.泰安101120801.日照101121501.东营101121201.德州101120401.滨州101121101.莱芜101121601.潍坊101120601.";

	
	//山西
	static String sx="太原101100101.阳泉101100301.晋城101100601.晋中101100401.临汾101100701.运城101100801.长治101100501.朔州101100901.忻州101101001.大同101100201.吕梁101101101.";
	//江苏
	static String js="南京101190101.苏州101190401.昆山101190404.南通101190501.太仓101190408.吴县101190406.徐州101190801.宜兴101190203.镇江101190301.淮安101190901.常熟101190402.盐城101190701.泰州101191201.无锡101190201.连云港101191001.扬州101190601.常州101191101.宿迁101191301.";
	//安徽
	static String ah="合肥101220101.巢湖101221601.蚌埠101220201.安庆101220601.六安101221501.滁州101221101.马鞍山101220501.阜阳101220801.宣城101221401.铜陵101221301.淮北101221201.芜湖101220301.毫州101220901.宿州101220701.淮南101220401.池州101221701.";
	//陕西
	static String sxi="西安101110101.韩城101110510.安康101110701.汉中101110801.宝鸡101110901.咸阳101110200.榆林101110401.渭南101110501.商洛101110601.铜川101111001.延安101110300.";
	//宁夏
	static String nx="银川101170101.固原101170401.中卫101170501.石嘴山101170201.吴忠101170301.";
	
	
	//甘肃
	static String gs="兰州101160101.白银101161301.庆阳101160401.酒泉101160801.天水101160901.武威101160501.张掖101160701.甘南101050204.临夏101161101.平凉101160301.定西101160201.金昌101160601.";
	//青海
	static String qh="西宁101150101.海北101150801.海西101150701.黄南101150301.果洛101150501.玉树101150601.海东101150201.海南101150401.";
	//湖北
	static String hub="武汉101200101.宜昌101200901.黄冈101200501.恩施101201001.荆州101200801.神农架101201201.十堰101201101.咸宁101200701.襄阳101200201.孝感101200401.随州101201301.黄石101200601.荆门101201401.鄂州101200301.";
	//湖南
	static String hun="长沙101250101.邵阳101250901.常德101250601.郴州101250501.吉首101251501.株洲101250301.娄底101250801.湘潭101250201.益阳101250701.永州101251401.岳阳101251001.衡阳101250401.怀化101251201.韶山101250202.张家界101251101.";
	//浙江
	static String zj="杭州101210101.湖州101210201.金华101210901.宁波101210401.丽水101210801.绍兴101210501.衢州101211001.嘉兴101210301.台州101210601.舟山101211101.温州101210701.";
	//江西
	static String jx="南昌101240101.萍乡101240901.九江101240201.上饶101240301.抚州101240401.吉安101240601.鹰潭101241101.宜春101240501.新余101241001.景德镇101240801.赣州101240701.";
	//福建
	static String fj="福州101230101.厦门101230201.龙岩101230701.南平101230901.宁德101230301.莆田101230401.泉州101230501.三明101230801.漳州101230601.";
	
	
	//贵州
	static String gz="贵阳101260101.安顺101260301.赤水101260208.遵义101260201.铜仁101260601.六盘水101260801.毕节101260701.凯里101260501.都匀101260401.";
	//四川
	static String sc="成都101270101.泸州101271001.内江101271201.凉山101271601.阿坝101271901.巴中101270901.广元101272101.乐山101271401.绵阳101270401.德阳101272001.攀枝花101270201.雅安101271701.宜宾101271101.自贡101270301.甘孜州101271801.达州101270601.资阳101271301.广安101270801.遂宁101270701.眉山101271501.南充101270501.";
	//广东
	static String gd="广州101280101.深圳101280601.潮州101281501.韶关101280201.湛江101281001.惠州101280301.清远101281301.东莞101281601.江门101281101.茂名101282001.肇庆101280901.汕尾101282101.河源101281201.揭阳101281901.梅州101280401.中山101281701.德庆101280905.阳江101281801.云浮101281401.珠海101280701.汕头101280501.佛山101280800.";
	//广西
	static String gx="南宁101300101.桂林101300501.阳朔101300510.柳州101300301.梧州101300601.玉林101300901.桂平101300802.贺州101300701.钦州101301101.贵港101300801.防城港101301401.百色101301001.北海101301301.河池101301201.来宾101300401.崇左101300201.";
	//云南
	static String yn="昆明101290101.保山101290501.楚雄101290801.德宏101291501.红河101290301.临沧101291101.怒江101291201.曲靖101290401.思茅101290901.文山101290601.玉溪101290701.昭通101291001.丽江101291401.大理101290201.";
	//海南
	static String hain="海口101310101.三亚101310201.儋州101310205.琼山101310102.通什101310222.文昌101310212.";
	//新疆
	static String xj="乌鲁木齐101130101.阿勒泰101131401.阿克苏101130801.昌吉101130401.哈密101131201.和田101131301.喀什101130901.克拉玛依101130201.石河子101130301.塔城101131101.库尔勒101130601.吐鲁番101130501.伊宁101131001.";
	
	//西藏
	static String xz="拉萨101140101.阿里101140701.昌都101140501.那曲101140601.日喀则101140201.山南101140301.林芝101140401.";
	//台湾
	static String tw="台北101340102.高雄101340201.";
	
	//所有城市
	static String placeStr = bj+sh+tj+cq+xg+am+hlj+jl+ln+nmg+hb+hn+sd+gs+qh+hub+hun+zj+jx+fj+gz+sc+gd+gx+yn+hain+xj+xz+tw+sx
			+js+ah+sxi+nx;
	
	static{
		place.put("北京",bj);
		place.put("上海",sh);
		place.put("天津",tj);
		place.put("重庆",cq);
		place.put("香港",xg);
		place.put("澳门",am);
		place.put("黑龙江",hlj);
		place.put("吉林",jl);
		place.put("辽宁",ln);
		place.put("内蒙古",nmg);
		place.put("河北",hb);
		place.put("河南",hn);
		place.put("山东",sd);
		place.put("甘肃",gs);
		place.put("青海",qh);
		place.put("湖北",hub);
		place.put("湖南",hun);
		place.put("浙江",zj);
		place.put("江西",jx);
		place.put("福建",fj);
		place.put("贵州",gz);
		place.put("四川",sc);
		place.put("广东",gd);
		place.put("广西",gx);
		place.put("云南",yn);
		place.put("海南",hain);
		place.put("新疆",xj);
		place.put("西藏",xz);
		place.put("台湾",tw);
		place.put("山西",sx);
		place.put("江苏",js);
		place.put("安徽",ah);
		place.put("陕西",sxi);
		place.put("宁夏",nx);
	}
	
	public static String getCityId(String pro,String city){
		if(StringUtils.isEmpty(city)){
			return DEFAULT_CITYID;
		}
//		int id = -1;
		String pstr=placeStr;
		if(place.containsKey(pro)){
			pstr = place.get(pro);
			
		}
		int start = pstr.indexOf(city);
		if(start==-1){
			return DEFAULT_CITYID;
		}
		pstr = pstr.substring(start+city.length());
		int end = pstr.indexOf(".");
		pstr = pstr.substring(0, end);
		return pstr;
		
	}
	
	

}
